#Generated by Fabric Compiler ( version 2022.2-SP1-Lite <build 132640> ) at Mon May  6 20:50:26 2024

remove_design -verilog "C:/Users/mjh/Desktop/zxhan/radix2-1024/example_design/rtl/ipsxe_fft_onboard_top.v"
remove_design -verilog "C:/Users/mjh/Desktop/zxhan/radix2-1024/example_design/rtl/ipsxe_fft_frame_chk.v"
remove_design -verilog "C:/Users/mjh/Desktop/zxhan/radix2-1024/example_design/rtl/ipsxe_fft_frame_gen.v"
remove_design -verilog "C:/Users/mjh/Desktop/zxhan/radix2-1024/example_design/rtl/ipsxe_fft_sync_arstn.v"
remove_design -verilog "C:/Users/mjh/Desktop/zxhan/radix2-1024/ipsxe_fft_exp_rom.v"
add_design "C:/Users/mjh/Desktop/zxhan/radix2-1024/src/rtl/i2s_loop.v"
add_design "C:/Users/mjh/Desktop/zxhan/radix2-1024/src/rtl/pgr_i2s_rx.v"
add_design "C:/Users/mjh/Desktop/zxhan/radix2-1024/src/rtl/stream_ctrler.v"
add_design "C:/Users/mjh/Desktop/zxhan/radix2-1024/src/rtl/top.v"
add_design C:/Users/mjh/Desktop/zxhan/radix2-1024/pnr/example_design/ipcore/PLL/PLL.idf
add_design C:/Users/mjh/Desktop/zxhan/radix2-1024/pnr/example_design/ipcore/FIFO_1/FIFO_1.idf
add_design C:/Users/mjh/Desktop/zxhan/radix2-1024/pnr/example_design/ipcore/RAM_1/RAM_1.idf
add_design "C:/Users/mjh/Desktop/zxhan/radix2-1024/src/rtl/ES7243E_reg_config.v"
add_design "C:/Users/mjh/Desktop/zxhan/radix2-1024/src/rtl/ES8156_reg_config.v"
add_design "C:/Users/mjh/Desktop/zxhan/radix2-1024/src/rtl/i2c_com.v"
add_design "C:/Users/mjh/Desktop/zxhan/radix2-1024/src/rtl/pgr_i2s_tx.v"
add_design "C:/Users/mjh/Desktop/zxhan/radix2-1024/src/rtl/voice_loop.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
remove_design -verilog "C:/Users/zxhan/Desktop/comp/Pango_voice/src/rtl/voice_loop.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
add_design "C:/Users/zxhan/Desktop/comp/Pango_voice/src/rtl/algorithm.v"
add_design "C:/Users/zxhan/Desktop/comp/Pango_voice/src/rtl/localbus/CRC4_D16.v"
add_design "C:/Users/zxhan/Desktop/comp/Pango_voice/src/rtl/localbus/local_bus_slve_cis.v"
add_design "C:/Users/zxhan/Desktop/comp/Pango_voice/src/rtl/localbus/uart_2dsp.v"
add_design "C:/Users/zxhan/Desktop/comp/Pango_voice/src/rtl/localbus/ubus_top.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
add_design C:/Users/zxhan/Desktop/comp/Pango_voice/pnr/example_design/ipcore/PLL0/PLL0.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
add_design C:/Users/zxhan/Desktop/comp/Pango_voice/pnr/example_design/ipcore/echo_add/echo_add.idf
remove_design -force C:/Users/zxhan/Desktop/comp/Pango_voice/pnr/example_design/ipcore/echo_add/echo_add.idf
add_design C:/Users/zxhan/Desktop/comp/Pango_voice/pnr/example_design/ipcore/Mul_Add/Mul_Add.idf
add_design C:/Users/zxhan/Desktop/comp/Pango_voice/pnr/example_design/ipcore/Mul_Acc/Mul_Acc.idf
add_design C:/Users/zxhan/Desktop/comp/Pango_voice/pnr/example_design/ipcore/Mul/Mul.idf
remove_design -force C:/Users/zxhan/Desktop/comp/Pango_voice/pnr/example_design/ipcore/Mul/Mul.idf
remove_design -force C:/Users/zxhan/Desktop/comp/Pango_voice/pnr/example_design/ipcore/Mul_Acc/Mul_Acc.idf
add_design "C:/Users/zxhan/Desktop/voice_merge/Pango_voice/pnr/example_design/source/rtl/DPRAM_init_param.v"
add_design "C:/Users/zxhan/Desktop/voice_merge/Pango_voice/pnr/example_design/source/rtl/iic_dri.v"
add_design "C:/Users/zxhan/Desktop/voice_merge/Pango_voice/pnr/example_design/source/rtl/ipml_dpram_v1_6_DPRAM.v"
add_design "C:/Users/zxhan/Desktop/voice_merge/Pango_voice/pnr/example_design/source/rtl/ms72xx_ctl.v"
add_design "C:/Users/zxhan/Desktop/voice_merge/Pango_voice/pnr/example_design/source/rtl/ms7200_ctl.v"
add_design "C:/Users/zxhan/Desktop/voice_merge/Pango_voice/pnr/example_design/source/rtl/ms7210_ctl.v"
add_design "C:/Users/zxhan/Desktop/voice_merge/Pango_voice/pnr/example_design/source/rtl/spectrum.v"
add_design "C:/Users/zxhan/Desktop/voice_merge/Pango_voice/pnr/example_design/source/DPRAM/DPRAM.v"
add_design "C:/Users/zxhan/Desktop/voice_merge/Pango_voice/pnr/example_design/source/DPRAM/DPRAM_tmpl.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
remove_design -verilog "C:/Users/zxhan/Desktop/voice_merge/Pango_voice/pnr/example_design/source/DPRAM/DPRAM_tmpl.v"
remove_design -verilog "C:/Users/zxhan/Desktop/voice_merge/Pango_voice/pnr/example_design/source/rtl/DPRAM_init_param.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
add_design C:/Users/zxhan/Desktop/comp/Pango_voice/pnr/example_design/ipcore/FIFO_HANN/FIFO_HANN.idf
add_design C:/Users/zxhan/Desktop/comp/Pango_voice/pnr/example_design/ipcore/HANN_RAM/HANN_RAM.idf
remove_design -force C:/Users/zxhan/Desktop/comp/Pango_voice/pnr/example_design/ipcore/HANN_RAM/HANN_RAM.idf
add_design C:/Users/zxhan/Desktop/comp/Pango_voice/pnr/example_design/ipcore/HANN_RAM/HANN_RAM.idf
add_design C:/Users/zxhan/Desktop/comp/Pango_voice/pnr/example_design/ipcore/MUL16x16/MUL16x16.idf
add_design C:/Users/zxhan/Desktop/comp/Pango_voice/pnr/example_design/ipcore/HANN_LUT/HANN_LUT.idf
add_design "C:/Users/zxhan/Desktop/comp/Pango_voice/src/rtl/hann.v"
add_design "C:/Users/zxhan/Desktop/comp/Pango_voice/src/rtl/sync_fifo.v"
remove_design -verilog "C:/Users/zxhan/Desktop/comp/Pango_voice/src/rtl/stream_ctrler.v"
remove_design -force C:/Users/zxhan/Desktop/comp/Pango_voice/pnr/example_design/ipcore/FIFO_HANN/FIFO_HANN.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
remove_design -force C:/Users/zxhan/Desktop/comp/Pango_voice/pnr/example_design/ipcore/Mul_Add/Mul_Add.idf
add_design "C:/Users/zxhan/Desktop/comp/Pango_voice/src/rtl/echo_des.v"
add_design "C:/Users/zxhan/Desktop/comp/Pango_voice/pnr/example_design/ipcore/mul/mul.idf"
add_design "C:/Users/zxhan/Desktop/comp/Pango_voice/pnr/example_design/ipcore/Mul_Add/Mul_Add.idf"
add_design "C:/Users/zxhan/Desktop/comp/Pango_voice/src/rtl/multiplue_sum.v"
remove_design -verilog "C:/Users/zxhan/Desktop/comp/Pango_voice/src/rtl/multiplue_sum.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/arp_cache.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/arp_mac_top.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/arp_rx.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/arp_tx.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/check_sum.vh"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/crc32_gen.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/eth_udp_test.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/ethernet_test.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/gvrd.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/gvrd_test.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/icmp.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/ip_layer.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/ip_rx.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/ip_tx.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/ip_tx_mode.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/mac_layer.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/mac_rx.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/mac_tx.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/mac_tx_mode.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/rgmii_interface.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/udp_ip_mac_top.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/udp_layer.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/udp_rx.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/udp_rx_bac.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/source/rtl/ethernet/udp_tx.v"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/ipcore/icmp_rx_ram_8_256/icmp_rx_ram_8_256.idf"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/ipcore/Dcache2Frame/Dcache2Frame.idf"
add_design "C:/Users/holdtecs/Desktop/merge/Pango_voice/pnr/example_design/ipcore/udp_shift_register/udp_shift_register.idf"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
remove_design -verilog "C:/Users/zxhan/Desktop/comp/bak/Pango_voice/pnr/example_design/source/rtl/ethernet/ethernet_test.v"
add_design "C:/Users/zxhan/Desktop/comp/bak/Pango_voice/src/rtl/boy2girl.v"
add_design "C:/Users/zxhan/Desktop/comp/bak/Pango_voice/src/rtl/denoise.v"
add_design "C:/Users/zxhan/Desktop/comp/bak/Pango_voice/src/rtl/girl2boy.v"
remove_design -verilog "C:/Users/zxhan/Desktop/comp/bak/Pango_voice/pnr/example_design/source/rtl/ethernet/eth_udp_test.v"
add_design "C:/Users/zxhan/Desktop/comp/bak/Pango_voice/pnr/example_design/source/rtl/ethernet/eth_udp_test.v"
add_design "C:/Users/zxhan/Desktop/comp/bak/Pango_voice/pnr/example_design/source/rtl/ethernet/ethernet_test.v"
remove_design -verilog "C:/Users/zxhan/Desktop/comp/bak/Pango_voice/pnr/example_design/source/rtl/ethernet/ethernet_test.v"
remove_design -verilog "C:/Users/zxhan/Desktop/comp/bak/Pango_voice/pnr/example_design/source/rtl/ethernet/eth_udp_test.v"
remove_design -verilog "C:/Users/zxhan/Desktop/comp/bak/Pango_voice/pnr/example_design/source/rtl/ethernet/udp_rx_bac.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
add_design C:/Users/zxhan/Desktop/comp/bak/Pango_voice/pnr/example_design/ipcore/LUT_2BOY/LUT_2BOY.idf
add_design C:/Users/zxhan/Desktop/comp/bak/Pango_voice/pnr/example_design/ipcore/LUT_2GIRL/LUT_2GIRL.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
add_fic "C:/Users/zxhan/Desktop/comp/bak/Pango_voice_new/pnr/example_design/synthesize/top_syn.fic"
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ipsxb_fft_demo_r2_1024
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ipsxb_fft_demo_r2_1024
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
add_design "C:/Projects/pango/Pango_voice/src/rtl/round_signed.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
remove_fic -force"C:/Projects/pango/Pango_voice/pnr/example_design/synthesize/top_syn.fic"
add_design "C:/Projects/pango/Pango_voice/pnr/example_design/ipcore/Sperate_door/Sperate_door.idf"
add_design "C:/Projects/pango/Pango_voice/src/rtl/separate1.v"
add_design "C:/Projects/pango/Pango_voice/src/rtl/separate2.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_netlist 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
add_constraint "D:/FPGA/Pango_magicbox/pnr/example_design/ipsxb_fft_onboard_top.scf"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
add_design "C:/Projects/pango/merge/Pango_magicbox/pnr/example_design/ipcore/FBANK_LUT1/FBANK_LUT1.idf"
add_design "C:/Projects/pango/merge/Pango_magicbox/pnr/example_design/ipcore/FBANK_LUT2/FBANK_LUT2.idf"
add_design "C:/Projects/pango/merge/Pango_magicbox/pnr/example_design/ipcore/logfbe_buff/logfbe_buff.idf"
add_design "C:/Projects/pango/merge/Pango_magicbox/pnr/example_design/ipcore/mul16x16_signed/mul16x16_signed.idf"
add_design "C:/Projects/pango/merge/Pango_magicbox/pnr/example_design/ipcore/mul55x16/mul55x16.idf"
add_design "C:/Projects/pango/merge/Pango_magicbox/src/rtl/DCT.v"
add_design "C:/Projects/pango/merge/Pango_magicbox/src/rtl/filterbank.v"
add_design "C:/Projects/pango/merge/Pango_magicbox/src/rtl/lifter.v"
add_design "C:/Projects/pango/merge/Pango_magicbox/src/rtl/log2.sv"
add_design "C:/Projects/pango/merge/Pango_magicbox/src/rtl/logE.v"
add_design "C:/Projects/pango/merge/Pango_magicbox/src/rtl/mfcc.v"
add_design "C:/Projects/pango/merge/Pango_magicbox/src/rtl/mul_add.v"
add_design "C:/Projects/pango/merge/Pango_magicbox/src/rtl/Squares.v"
add_design "C:/Projects/pango/merge/Pango_magicbox/src/rtl/log2.v"
remove_design -verilog "C:/Projects/pango/merge/Pango_magicbox/src/rtl/log2.sv"
remove_design -verilog "C:/Projects/pango/merge/Pango_magicbox/src/rtl/log2.v"
add_design "C:/Projects/pango/merge/Pango_magicbox/src/rtl/log2.sv"
remove_design -verilog "C:/Projects/pango/merge/Pango_magicbox/src/rtl/log2.sv"
add_design "C:/Projects/pango/merge/Pango_magicbox/src/rtl/log2.v"
add_design D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/div1024/div1024.idf
add_design D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/MUL26x16/MUL26x16.idf
add_design "D:/projects/pango/Pango_magicbox/src/rtl/mfcc_avg.v"
add_design D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/MUL17x17/MUL17x17.idf
add_design "D:/projects/pango/Pango_magicbox/src/rtl/btn_deb_fix.v"
add_design "D:/projects/pango/Pango_magicbox/src/rtl/voice_recgnize.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
add_design "D:/projects/pango/Pango_magicbox/src/rtl/key_ctl.v"
add_design "D:/projects/pango/Pango_magicbox/src/rtl/spectrogram.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
add_design "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/B_LUT/B_LUT.v"
add_design "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/B_LUT/rtl/B_LUT_init_param.v"
add_design "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/B_LUT/rtl/ipml_rom_v1_5_B_LUT.v"
add_design "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/B_LUT/rtl/ipml_spram_v1_5_B_LUT.v"
add_design "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/DRAM_spectrogram/DRAM_spectrogram.v"
add_design "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/DRAM_spectrogram/rtl/DRAM_spectrogram_init_param.v"
add_design "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/DRAM_spectrogram/rtl/ipml_dpram_v1_6_DRAM_spectrogram.v"
add_design "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/G_LUT/G_LUT.v"
add_design "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/G_LUT/rtl/G_LUT_init_param.v"
add_design "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/G_LUT/rtl/ipml_rom_v1_5_G_LUT.v"
add_design "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/G_LUT/rtl/ipml_spram_v1_5_G_LUT.v"
add_design "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/R_LUT/R_LUT.v"
add_design "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/R_LUT/rtl/ipml_rom_v1_5_R_LUT.v"
add_design "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/R_LUT/rtl/ipml_spram_v1_5_R_LUT.v"
add_design "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/R_LUT/rtl/R_LUT_init_param.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
remove_design -verilog "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/DRAM_spectrogram/rtl/DRAM_spectrogram_init_param.v"
remove_design -verilog "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/B_LUT/rtl/B_LUT_init_param.v"
remove_design -verilog "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/DRAM_spectrogram/rtl/DRAM_spectrogram_init_param.v"
remove_design -verilog "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/G_LUT/rtl/G_LUT_init_param.v"
remove_design -verilog "D:/projects/pango/Pango_magicbox/pnr/example_design/ipcore/R_LUT/rtl/R_LUT_init_param.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
add_design "C:/Users/mjh/Desktop/final_competition/Pango_magicbox/src/rtl/front_show.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
